# ImportCell

In [1]:
import numpy as np
import pandas as pd
from pandasql import sqldf

# DataLoad

In [2]:
devices = pd.read_csv("C:\\Users\\Mr0Wo\\OneDrive\\Рабочий стол\\Git_repositories\\Data-science-cases\\Analytical-cases\\Shift+Enter_MTS\\DataAnalytic\\task3\\devices.csv")

In [3]:
emp_name = pd.read_csv("C:\\Users\\Mr0Wo\\OneDrive\\Рабочий стол\\Git_repositories\\Data-science-cases\\Analytical-cases\\Shift+Enter_MTS\\DataAnalytic\\task3\\emp_name.csv")

In [4]:
operators = pd.read_csv("C:\\Users\\Mr0Wo\\OneDrive\\Рабочий стол\\Git_repositories\\Data-science-cases\\Analytical-cases\\Shift+Enter_MTS\\DataAnalytic\\task3\\operators.csv")

# Data

In [5]:
devices

   empl_id   date_from     date_to              device
0      111  2019-08-08  2019-10-07           iPhone 11
1      121  2019-11-10  2021-09-10         Samsung A52
2      122  2019-01-13  2020-11-10         Xiaomi Mi10
3      111  2019-10-08  2021-01-10           iPhone 12
4      122  2020-11-11  2021-08-12  Xiaomi Mi 11 Ultra
5      122  2021-08-13  2022-01-17           iPhone 13
6      111  2021-01-11  2022-12-07           iPhone 13

In [6]:
operators

   empl_id   date_from     date_to  op_name
0      111  2019-11-10  2020-12-13  МегаФон
1      122  2018-11-10  2019-10-17      МТС
2      111  2020-12-14  2021-09-09      МТС
3      122  2019-10-18  2020-12-03  МегаФон
4      111  2021-09-10  2022-08-13    Теле2
5      121  2019-11-10  2020-12-10   Билайн

In [7]:
emp_name

   empl_id first_name
0      111       Егор
1      121    Тимофей
2      122      Антон

# Task

У нас есть несколько датасетов, включая таблицу с историей владения мобильными
телефонами, содержащую информацию о владельцах (сотрудниках одной компании), вне
зависимости от того, у какого оператора связи они находились или находятся сейчас.
Во второй таблице есть данные о времени пребывания этих людей с определенными
операторами связи.
Используй имеющиеся данные, чтобы установить максимальное время владения телефоном
для выбранного оператора связи. Эта информация позволит нам сделать выводы и
сформулировать начальные гипотезы о том, существует ли какая-то связь между марками
телефонов и длительностью пребывания их владельцев у определенных операторов сотовой
связи.

# SQLWay

In [31]:
q = """SELECT
op_name,
device
FROM
(SELECT
o.op_name,
d.device,
ROW_NUMBER() OVER (PARTITION BY e.empl_id,o.op_name
ORDER BY MIN(d.date_to,o.date_to,1) -
MAX(d.date_from,o.date_from,1) DESC) AS rn
FROM operators o
LEFT JOIN devices d
ON (o.date_from BETWEEN d.date_from AND d.date_to
OR o.date_to BETWEEN d.date_from AND d.date_to)
AND o.empl_id = d.empl_id
JOIN emp_name e
ON o.empl_id = e.empl_id) res
WHERE
res.rn = 1
 
"""

In [32]:
sqldf(q)

   op_name       device
0      МТС    iPhone 12
1  МегаФон    iPhone 12
2    Теле2    iPhone 13
3   Билайн  Samsung A52
4      МТС  Xiaomi Mi10
5  МегаФон  Xiaomi Mi10